In [1]:
## Matt Garcia
## CIS - 2532
## NET - 02
## problem 17.1 
## book db

In [2]:
import sqlite3

In [3]:
connection = sqlite3.connect('books.db')

import pandas as pd

pd.options.display.max_columns = 10

In [4]:
pd.read_sql('SELECT last FROM authors ORDER BY last DESC', connection)

     last
0    Wald
1   Quirk
2  Deitel
3  Deitel
4  Deitel

In [5]:
pd.read_sql('SELECT title FROM titles ORDER BY title ASC', connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

In [6]:
## I for sure had to ask a friend for help with this one. 

pd.read_sql("""SELECT t.title, t.copyright, a.isbn
FROM titles AS t
INNER JOIN author_ISBN AS a ON t.isbn = a.isbn
INNER JOIN authors AS au ON a.id = au.id
WHERE au.first = 'Abbey' AND au.last = 'Deitel'
ORDER BY t.title ASC""", connection)

                              title copyright        isbn
0     Internet & WWW How to Program      2012  0132151006
1  Visual Basic 2012 How to Program      2014  0133406954

In [7]:
cursor = connection.cursor()

In [8]:
cursor = cursor.execute("""INSERT INTO authors (first, last, id)
                            VALUES ('Matt', 'Garcha', 6)""")

In [9]:
pd.read_sql("""SELECT first, last
                FROM authors
                WHERE first='Matt'""", connection)

  first    last
0  Matt  Garcha

In [14]:
cursor.execute("INSERT INTO author_ISBN (id, isbn) VALUES (?, ?)", (6, '0111111'))

In [16]:
cursor.execute("INSERT INTO titles (isbn, title, edition, copyright) VALUES (?, ?, ?, ?)", ('0111111', 'Its a Book Yall', 4, 1518))

In [18]:
connection.commit()

In [12]:
pd.read_sql("""SELECT * FROM authors""", connection)

   id      first    last
0   1       Paul  Deitel
1   2     Harvey  Deitel
2   3      Abbey  Deitel
3   4        Dan   Quirk
4   5  Alexander    Wald
5   6       Matt  Garcha

In [19]:
pd.read_sql("""SELECT * FROM titles""", connection)

          isbn                             title  edition copyright
0   0135404673     Intro to Python for CS and DS        1      2020
1   0132151006     Internet & WWW How to Program        5      2012
2   0134743350               Java How to Program       11      2018
3   0133976890                  C How to Program        8      2016
4   0133406954  Visual Basic 2012 How to Program        6      2014
5   0134601548          Visual C# How to Program        6      2017
6   0136151574         Visual C++ How to Program        2      2008
7   0134448235                C++ How to Program       10      2017
8   0134444302            Android How to Program        3      2017
9   0134289366         Android 6 for Programmers        3      2016
10     0111111                   Its a Book Yall        4      1518